# Extensions VSCode baked dans le volume user au premier démarrage
# Installed into the user volume on first startup

# OpenClaw / ACP
xiaoyaner.openclaw-node-vscode
formulahendry.acp-client

# Git
eamodio.gitlens

# Python
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter

# JavaScript / TypeScript
dbaeumer.vscode-eslint
esbenp.prettier-vscode

# Docker
ms-azuretools.vscode-docker

# Rust
rust-lang.rust-analyzer

# Go
golang.go

# YAML / TOML
redhat.vscode-yaml
tamasfe.even-better-toml

# Utilitaires
streetsidesoftware.code-spell-checker
